In [1]:
import pandas as pd

In [7]:
friend_dict_list = [
    {'name': 'John', 'age':25, 'job':'student'},
    {'name': 'Nate', 'age':30, 'job':'teacher'}
]

In [8]:
df = pd.DataFrame(friend_dict_list)

In [9]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [10]:
# dictionary의 키의 값의 순서가 보장되지 않는다. 따라서 조정이 필요.
df = df[['name', 'age', 'job']]

In [11]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [12]:
# 키의 순서를 보장
from collections import OrderedDict

In [13]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[ 25,30]),
        ('job',['student','teacher'])
    ]
)

In [14]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [15]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [16]:
# python의 list를 통한 Dataframe 생성
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [17]:
column_name = ['name', 'age', 'job']

In [18]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [19]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [20]:
friend_list = [
    ['name', ['John','Nate']],
    ['age', [20,30]],
    ['job', ['student','teacher']]
]

In [22]:
df = pd.DataFrame.from_dict(dict(friend_list))

In [23]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher